In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
con = sqlite3.connect('test_matches.db')

In [3]:
df_matches =  pd.read_sql_query("SELECT * FROM match", con)

In [4]:
df_matches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         100 non-null    int64
 1   game_id    100 non-null    object
 2   team_1     100 non-null    object
 3   team_2     100 non-null    object
 4   gold_diff  100 non-null    object
 5   winner     100 non-null    object
dtypes: int64(1), object(5)
memory usage: 4.8+ KB

In [5]:
df_matches.sample(5)

,id,game_id,team_1,team_2,gold_diff,winner
38,39,NA1_4084766189,"[2500, 2500, 2892, 4268, 5988, 7476, 9565, 115...","[2500, 2500, 3435, 4862, 7068, 8417, 10414, 12...",[ 0 0 -543 -594 -1080 -941 -849 -5...,Team 2
69,70,NA1_4161025138,"[2500, 2500, 3021, 4428, 5545, 7536, 8924, 109...","[2500, 2500, 2964, 5343, 6543, 8546, 10709, 12...",[ 0 0 57 -915 -998 -1010 -1785 -11...,Team 1
77,78,NA1_4141622491,"[2500, 2500, 2868, 4402, 6295, 7693, 9049, 113...","[2500, 2500, 2839, 4206, 5617, 7777, 9767, 118...",[ 0 0 29 196 678 -84 -718 -5...,Team 2
75,76,NA1_4145006736,"[2500, 2500, 2881, 4258, 6023, 7485, 8664, 102...","[2500, 2500, 2886, 4256, 6434, 7917, 9536, 112...",[ 0 0 -5 2 -411 -432 -...,Team 1
0,1,NA1_4155081821,"[2500, 2500, 3076, 4705, 5845, 7620, 8865, 101...","[2500, 2500, 2945, 4917, 6725, 8345, 9748, 124...",[ 0 0 131 -212 -880 -725 -...,Team 1

In [6]:
df_matches.drop_duplicates(subset=['game_id'])

,id,game_id,team_1,team_2,gold_diff,winner
0,1,NA1_4155081821,"[2500, 2500, 3076, 4705, 5845, 7620, 8865, 101...","[2500, 2500, 2945, 4917, 6725, 8345, 9748, 124...",[ 0 0 131 -212 -880 -725 -...,Team 1
1,2,NA1_4148645836,"[2500, 2500, 2649, 3913, 5486, 6865, 8187, 988...","[2500, 3020, 3127, 5605, 6767, 9455, 10660, 12...",[ 0 -520 -478 -1692 -1281 -2590 -2...,Team 1
2,3,NA1_4147765789,"[2500, 2500, 2907, 4267, 6494, 8279, 10132, 12...","[2500, 2500, 2882, 4661, 5754, 7462, 9607, 113...",[ 0 0 25 -394 740 817 525 8...,Team 2
3,4,NA1_4146420670,"[2500, 2500, 2914, 4279, 5677, 7711, 9627, 111...","[2500, 2500, 2917, 4243, 6373, 7909, 9537, 126...",[ 0 0 -3 36 -696 -198 ...,Team 1
4,5,NA1_4146375941,"[2500, 2500, 2881, 5599, 6848, 8233, 9455, 115...","[2500, 2520, 2859, 4610, 6144, 7885, 9728, 110...",[ 0 -20 22 989 704 348 -273 5...,Team 1
...,...,...,...,...,...,...
95,96,NA1_4095051926,"[2500, 2500, 2678, 4209, 5536, 6970, 8528, 110...","[2500, 2500, 3609, 4929, 6573, 8979, 10378, 12...",[ 0 0 -931 -720 -1037 -2009 -1850 -14...,Team 1
96,97,NA1_4094111987,"[2500, 2500, 2872, 4348, 5841, 6945, 8285, 992...","[2500, 2500, 2934, 4567, 5889, 7399, 9709, 112...",[ 0 0 -62 -219 -48 -454 -1...,Team 1
97,98,NA1_4094054225,"[2500, 2500, 2929, 4688, 6242, 7959, 9310, 111...","[2500, 2500, 2910, 4920, 6021, 7489, 9141, 106...",[ 0 0 19 -232 221 470 169 4...,Team 2
98,99,NA1_4094030126,"[2500, 2500, 2784, 4680, 6388, 7639, 9333, 108...","[2500, 2500, 2889, 4552, 6136, 7754, 9710, 114...",[ 0 0 -105 128 252 -115 -377 -6...,Team 1
99,100,NA1_4093981884,"[2500, 2500, 2907, 4613, 6039, 7671, 9491, 112...","[2500, 2500, 2670, 4250, 5864, 7239, 8754, 102...",[ 0 0 237 363 175 432 737 1029 2606 ...,Team 2

In [8]:
df_data = df_matches[["gold_diff", "winner"]]

In [9]:
df_data.head()

                                           gold_diff  winner
0  [     0      0    131   -212   -880   -725   -...  Team 1
1  [     0   -520   -478  -1692  -1281  -2590  -2...  Team 1
2  [    0     0    25  -394   740   817   525   8...  Team 2
3  [     0      0     -3     36   -696   -198    ...  Team 1
4  [    0   -20    22   989   704   348  -273   5...  Team 1

In [31]:
sample_1 = df_data["gold_diff"][0]
sample_1

'[     0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278]'

In [57]:
sample_1 = sample_1.strip(" []\n")

In [38]:
test = str(sample_1)
test

'[     0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278]'

In [61]:
test  = test.strip("[]")
test = test.strip()
test

'0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278'

In [64]:
test_1 = df_matches["team_1"][0]
test_1

'[2500, 2500, 3076, 4705, 5845, 7620, 8865, 10102, 12133, 15487, 16799, 19575, 21502, 22695, 25062, 26646, 29657, 31571, 33253, 35524, 37121, 39958, 41876, 44169, 45370, 47336, 49782, 50232]'

In [87]:
test_1 = test_1.strip("[]'").strip(" '' ")
test_1
arr = test_1.split(", ")
arr[0]

'2500'